# coding=utf-8
# >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>> >>
# Author     : John
# Created on : 2020-12-8
# Description: 健康档案质控报告V2
# *****************************************************************

import sys
sys.path.append("../../../../")
from instance.zyjk.EHR.PageObject.ReportPO import *
Report_PO = ReportPO()


# print("表1 = 1.常住人口电子健康档案工作指标 >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>")
# Report_PO.colResult(["表1.电子健康档案建档率", "=", "辖区内常住人口建立电子健康档案人数", "/", "辖区内常住人口数", "*100"], "保留2位")
# Report_PO.colResult(["表1.目标签约人数", "=", "辖区内常住人口数", "*0.3"], "取整")
# Report_PO.colResult(["表1.签约完成率", "=", "实际签约人数", "/", "目标签约人数", "*100"], "保留2位")


print("\n表5 = 5.签约居民中65岁及以上老年人电子健康档案工作指标 >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>")
Report_PO.colResult(["表5.签约居民中65岁及以上老年人占家庭医生签约总人数占比", "=", "签约居民中65岁及以上老年人", "/", "全部签约人数", "*100"], "保留2位")
Report_PO.colResult(["表5.签约居民中65岁及以上老年人电子健康档案建档率", "=", "签约居民中65岁及以上老年人有电子健康档案的人数", "/", "全部签约人数", "*100"], "保留2位")


print("\n表6 = 6.签约居民中高血压患者电子健康档案工作指标 >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>")
Report_PO.colResult(["表6.签约居民中高血压患者管理人数占家庭医生签约总人数占比", "=", "签约居民中高血压患者管理人数", "/", "签约人数", "*100"], "保留2位")
Report_PO.colResult(["表6.签约居民中高血压患者电子健康档案建档率", "=", "签约居民中高血压患者有电子健康档案的人数", "/", "签约居民中高血压患者管理人数", "*100"], "保留2位")
Report_PO.save()