# coding=utf-8
# >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>> >>
# Author     : John
# Created on : 2020-12-8
# Description: 健康档案质控报告V2
# *****************************************************************

import sys
sys.path.append("../../../../")
from instance.zyjk.EHR.PageObject.ReportPO import *
Report_PO = ReportPO()

# 关闭所有excel文档
Report_PO.closeExcelPid()


# print("\n" + "表1 = 1.常住人口电子健康档案工作指标".center(100, "-"))
# Report_PO.colResult([["表1.电子健康档案建档率", "=", "辖区内常住人口建立电子健康档案人数", "/", "辖区内常住人口数", "*100", 2],
# ["表1.目标签约人数", "=", "辖区内常住人口数", "*0.3", 0],
# ["表1.签约完成率", "=", "实际签约人数", "/", "目标签约人数", "*100", 2]])
#
#
# print("\n" + "表4 = 4.签约居民电子健康档案工作指标".center(100, "-"))
# Report_PO.colResult([["表4.签约居民电子建档率", "=", "签约居民中有电子健康档案人数", "/", "签约人数", "*100", 2],
# ["表4.签约居民电子健康档案规范建档占比", "=", "100", "-", "规范建档分子", "/", "规范建档分母", "*100", 2],
# ["表4.签约居民电子健康档案更新率", "=", "签约居民中有电子健康档案更新记录人数", "/", "签约居民中有电子健康档案人数", "*100", 2],
# ["表4.签约居民中重点人群电子健康档案更新率", "=", "重点人群存在档案更新", "/", "重点人群", "*100", 2],
# ["表4.签约居民中非重点人群电子健康档案更新率", "=", "非重点人群存在档案更新", "/", "非重点人群", "*100", 2],
# ["表4.签约居民电子健康档案利用率", "=", "一年内签约居民中电子健康档案有调阅记录的人数", "/", "签约居民中有电子健康档案人数", "*100"]])
#
#
# print("\n" + "表5 = 5.签约居民中65岁及以上老年人电子健康档案工作指标".center(100, "-"))
# Report_PO.colResult([["表5.签约居民中65岁及以上老年人占家庭医生签约总人数占比", "=", "签约居民中65岁及以上老年人", "/", "全部签约人数", "*100", 2],
# ["表5.签约居民中65岁及以上老年人电子健康档案建档率", "=", "签约居民中65岁及以上老年人有电子健康档案的人数", "/", "全部签约人数", "*100", 2],
# ["表5.签约居民中65岁及以上老年人电子健康档案规范建档占比", "=", "100", "-", "规范建档占比分子", "/", "规范建档占比分母", "*100", 2],
# ["表5.签约居民中65岁及以上老年人电子健康档案更新率", "=", "签约居民中65岁及以上老年人有电子健康档案更新记录人数", "/", "签约居民中65岁及以上老年人有电子健康档案的人数", "*100", 2],
# ["表5.签约居民中65岁及以上老年人电子健康档案利用率", "=", "一年内签约居民中65岁及以上老年人电子健康档案有调阅记录的人数", "/", "签约居民中65岁及以上老年人有电子健康档案的人数", "*100", 2]])
#
#
# print("\n" + "表6 = 6.签约居民中高血压患者电子健康档案工作指标".center(100, "-"))
# Report_PO.colResult([["表6.签约居民中高血压患者管理人数占家庭医生签约总人数占比", "=", "签约居民中高血压患者管理人数", "/", "签约人数", "*100", 2],
# ["表6.签约居民中高血压患者电子健康档案建档率", "=", "签约居民中高血压患者有电子健康档案的人数", "/", "签约居民中高血压患者管理人数", "*100", 2],
# ["表6.签签约居民中高血压患者电子健康档案规范建档占比", "=", "100", "-", "规范建档占比分子", "/", "规范建档占比分母", "*100", 2],
# ["表6.签约居民中高血压患者电子健康档案更新率", "=", "签约居民中高血压患者有电子健康档案更新记录人数", "/", "签约居民中高血压患者有电子健康档案的人数", "*100", 2],
# ["表6.签约居民中高血压患者电子健康档案利用率", "=", "一年内签约居民中高血压患者电子健康档案有调阅记录的人数", "/", "签约居民中高血压患者有电子健康档案的人数", "*100", 2],
# ["表6.签约居民中高血压患者血压控制率", "=", "签约居民中高血压患者血压控制人数", "/", "签约居民中高血压患者管理人数", "*100", 2]])
#
#
# print("\n" + "表7 = 7.签约居民中糖尿病患者电子健康档案工作指标".center(100, "-"))
# Report_PO.colResult([["表7.签约居民中糖尿病患者管理人数占家庭医生签约总人数占比", "=", "签约居民中糖尿病患者管理人数", "/", "签约人数", "*100", 2],
# ["表7.签约居民中糖尿病患者电子健康档案建档率", "=", "签约居民中糖尿病患者有电子健康档案的人数", "/", "签约居民中糖尿病患者管理人数", "*100", 2],
# ["表7.签签约居民中糖尿病患者电子健康档案规范建档占比", "=", "100", "-", "规范建档占比分子", "/", "规范建档占比分母", "*100", 2],
# ["表7.签约居民中糖尿病患者电子健康档案更新率", "=", "签约居民中糖尿病患者有电子健康档案更新记录人数", "/", "签约居民中糖尿病患者有电子健康档案的人数", "*100", 2],
# ["表7.签约居民中糖尿病患者电子健康档案利用率", "=", "一年内签约居民中糖尿病患者电子健康档案有调阅记录的人数", "/", "签约居民中糖尿病患者有电子健康档案的人数", "*100", 2],
# ["表7.签约居民中糖尿病患者血糖控制率", "=", "签约居民中糖尿病患者血糖控制人数", "/", "签约居民中糖尿病患者管理人数", "*100", 2]])
#
#
# print("\n" + "表8 = 8.签约居民中重点人群电子健康档案工作指标".center(100, "-"))
# Report_PO.colResult([["表8.签约居民中重点人群电子健康档案建档率", "=", "签约居民中重点人群有电子健康档案的人数", "/", "签约居民中重点人群", "*100", 2],
# ["表8.签约居民中重点人群电子健康档案规范建档占比", "=", "100", "-", "规范建档占比分子", "/", "规范建档占比分母", "*100", 2],
# ["表8.签约居民中重点人群电子健康档案更新率", "=", "签约居民中重点人群有电子健康档案更新记录人数", "/", "签约居民中重点人群有电子健康档案的人数", "*100", 2],
# ["表8.签约居民中重点人群电子健康档案利用率", "=", "一年内签约居民中重点人群电子健康档案有调阅记录的人数", "/", "签约居民中重点人群有电子健康档案的人数", "*100", 2]])
#
#
# print("\n" + "表11 = 11.家庭医生维度签约居民电子健康档案工作指标".center(100, "-"))
# Report_PO.colResult([["表11.签约居民电子建档率", "=", "签约居民中有电子健康档案人数", "/", "签约人数", "*100", 2],
# ["表11.签约居民电子健康档案规范建档占比", "=", "100", "-", "规范建档分子", "/", "规范建档分母", "*100", 2],
# ["表11.签约居民电子健康档案更新率", "=", "签约居民中有电子健康档案更新记录人数", "/", "签约居民中有电子健康档案人数", "*100", 2],
# ["表11.签约居民中重点人群电子健康档案更新率", "=", "重点人群存在档案更新", "/", "重点人群", "*100", 2],
# ["表11.签约居民中非重点人群电子健康档案更新率", "=", "非重点人群存在档案更新", "/", "非重点人群", "*100", 2],
# ["表11.签约居民电子健康档案利用率", "=", "一年内签约居民中电子健康档案有调阅记录的人数", "/", "签约居民中有电子健康档案人数", "*100", 2]])
#
#
# print("\n" + "表12 = 12.家庭医生维度签约居民中65岁及以上老年人电子健康档案工作指标".center(100, "-"))
# Report_PO.colResult([["表12.签约居民中65岁及以上老年人占家庭医生签约总人数占比", "=", "签约居民中65岁及以上老年人", "/", "全部签约人数", "*100", 2],
# ["表12.签约居民中65岁及以上老年人电子健康档案建档率", "=", "签约居民中65岁及以上老年人有电子健康档案的人数", "/", "全部签约人数", "*100", 2],
# ["表12.签约居民中65岁及以上老年人电子健康档案规范建档占比", "=", "100", "-", "规范建档占比分子", "/", "规范建档占比分母", "*100", 2],
# ["表12.签约居民中65岁及以上老年人电子健康档案更新率", "=", "签约居民中65岁及以上老年人有电子健康档案更新记录人数", "/", "签约居民中65岁及以上老年人有电子健康档案的人数", "*100", 2],
# ["表12.签约居民中65岁及以上老年人电子健康档案利用率", "=", "一年内签约居民中65岁及以上老年人电子健康档案有调阅记录的人数", "/", "签约居民中65岁及以上老年人有电子健康档案的人数", "*100", 2]])
#
#
# print("\n" + "表13 = 13.家庭医生维度签约居民中高血压患者电子健康档案工作指标".center(100, "-"))
# Report_PO.colResult([["表13.签约居民中高血压患者管理人数占家庭医生签约总人数占比", "=", "签约居民中高血压患者有电子健康档案的人数", "/", "签约人数", "*100", 2, ["if", "签约居民中高血压患者电子健康档案建档率", "==", "100"]],
# ["表13.签约居民中高血压患者管理人数占家庭医生签约总人数占比", "=", "签约居民中高血压患者管理人数", "/", "签约人数", "*100", 2, ["if", "签约居民中高血压患者电子健康档案建档率", "!=", "100"]],
# ["表13.签约居民中高血压患者电子健康档案建档率", "=", "签约居民中高血压患者有电子健康档案的人数", "/", "签约居民中高血压患者管理人数", "*100", 2],
# ["表13.签签约居民中高血压患者电子健康档案规范建档占比", "=", "100", "-", "规范建档占比分子", "/", "规范建档占比分母", "*100", 2],
# ["表13.签约居民中高血压患者电子健康档案更新率", "=", "签约居民中高血压患者有电子健康档案更新记录人数", "/", "签约居民中高血压患者有电子健康档案的人数", "*100", 2],
# ["表13.签约居民中高血压患者电子健康档案利用率", "=", "一年内签约居民中高血压患者电子健康档案有调阅记录的人数", "/", "签约居民中高血压患者有电子健康档案的人数", "*100", 2]])
#
#
# print("\n" + "表14 = 14.家庭医生维度签约居民中糖尿病患者电子健康档案工作指标".center(100, "-"))
# Report_PO.colResult([["表14.签约居民中糖尿病患者管理人数占家庭医生签约总人数占比", "=", "签约居民中糖尿病患者有电子健康档案的人数", "/", "签约人数", "*100", 2, ["if", "签约居民中糖尿病患者电子健康档案建档率", "==", "100"]],
# ["表14.签约居民中糖尿病患者管理人数占家庭医生签约总人数占比", "=", "签约居民中糖尿病患者管理人数", "/", "签约人数", "*100", 2, ["if", "签约居民中糖尿病患者电子健康档案建档率", "!=", "100"]],
# ["表14.签约居民中糖尿病患者电子健康档案建档率", "=", "签约居民中糖尿病患者有电子健康档案的人数", "/", "签约居民中糖尿病患者管理人数", "*100", 2],
# ["表14.签签约居民中糖尿病患者电子健康档案规范建档占比", "=", "100", "-", "规范建档占比分子", "/", "规范建档占比分母", "*100", 2],
# ["表14.签约居民中糖尿病患者电子健康档案更新率", "=", "签约居民中糖尿病患者有电子健康档案更新记录人数", "/", "签约居民中糖尿病患者有电子健康档案的人数", "*100", 2],
# ["表14.签约居民中糖尿病患者电子健康档案利用率", "=", "一年内签约居民中糖尿病患者电子健康档案有调阅记录的人数", "/", "签约居民中糖尿病患者有电子健康档案的人数", "*100", 2]])
#
#
# print("\n" + "表15 = 15.家庭医生维度签约居民中重点人群电子健康档案工作指标".center(100, "-"))
# Report_PO.colResult([["表15.签约居民中重点人群电子健康档案建档率", "=", "签约居民中重点人群有电子健康档案的人数", "/", "签约居民中重点人群", "*100", 2],
# ["表15.签约居民中重点人群电子健康档案规范建档占比", "=", "100", "-", "规范建档占比分子", "/", "规范建档占比分母", "*100", 2],
# ["表15.签约居民中重点人群电子健康档案更新率", "=", "签约居民中重点人群有电子健康档案更新记录人数", "/", "签约居民中重点人群有电子健康档案的人数", "*100", 2],
# ["表15.签约居民中重点人群电子健康档案利用率", "=", "一年内签约居民中重点人群电子健康档案有调阅记录的人数", "/", "签约居民中重点人群有电子健康档案的人数", "*100", 2]])


print("\n" + "表18".center(100, "-"))
Report_PO.colResult([["表18.通过质控评价字段占比", "=", "五个评价维度都通过质控评价字段数", "/", "签约居民档案封面及个人基本信息表字段总数", "*100", 2]])


print("\n" + "表20".center(100, "-"))
Report_PO.colResult([["表20.通过质控评价字段占比", "=", "五个评价维度都通过质控评价字段数", "/", "高血压随访表字段总数", "*100", 2]])


print("\n" + "表21".center(100, "-"))
Report_PO.colResult([["表21.通过质控评价字段占比", "=", "五个评价维度都通过质控评价字段数", "/", "Ⅱ型糖尿病随访表字段总数", "*100", 2]])


# 表18  i/c=j



Report_PO.save()
Report_PO.openFile()




