# -*- coding: utf-8 -*-
# *****************************************************************
# Author     : John
# Date       : 2021-11-19
# Description: # 内置函数 abs 绝对值
# https://docs.python.org/zh-cn/3.7/library/functions.html
# *****************************************************************

# 定义：# 返回一个数的绝对值。实参可以是整数或浮点数。如果实参是一个复数，返回它的模。
# 数学中的复数的模。将复数的实部与虚部的平方和的正的平方根的值称为该复数的模。

# 整数
print(abs(100))  # 100
print(abs(-100))  # 100

# 浮点数
print(abs(-100.12))  # 100.12

# 复数（complex）
x = 2.4 + 5.6j
print(type(x))  # <class 'complex'>
print(abs(x))  # 6.092618484691126   //返回模

# 复数的实部
print(x.real)  # 2.4

# 复数的虚部
print(x.imag)  # 5.6

# 共轭复数： 两个实部相等，虚部互为相反数的复数互为共轭复数。
# 返回共轭复数，x.conjugate()；
print(x.conjugate())  # (2.4-5.6j)

# 复数的加法，实部加实部，虚部加虚部；
# 复数的减法，实部减实部，虚部减虚部；
# 复数的乘法： 设z1=a+bj，z2=c+dj是任意两个复数，那么它们的积(a+bj)(c+dj)=(ac-bd)+(bc+ad)j；
x = 3+4j
y = 5-6j
print(x+y)  # (8-2j)
print(x-y)  # (-2+10j)
print(x*y)  # (39+2j)   (3*5-(4*-6) + (4*5+3*(-6)j)  =  39 + 2j

