# coding=utf-8
# >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
# Author     : John
# Created on : 2020-1-6
# Description: PIM基层健康管理平台之 护士主业务流程，床头卡病人入区
# https://blog.csdn.net/xc_zhou/article/details/82415870 chrome浏览器的options参数
# http://192.168.0.81:8324/login
# *****************************************************************

from instance.zyjk.PIM.PageObject.PimPO import *
Pim_PO = PimPO()

# >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>

Pim_PO.doctorAdvice(user_test123, "1-07")


