# coding=utf-8
#***************************************************************
# Author     : John
# Created on : 2020-11-17
# Description: 商务管理 - 库存管理（入库，出库，明细）
#***************************************************************

import os, sys
# sys.path.append("../../../../")
from instance.zyjk.OA.PageObject.OaPO import *
Oa_PO = OaPO()
List_PO = ListPO()
Time_PO = TimePO()
Net_PO = NetPO()
Data_PO = DataPO()
File_PO = FilePO()
Excel_PO = ExcelPO()
Char_PO = CharPO()


#***************************************************************#***************************************************************
'''1,入库 （生产厂商，出厂批次号，入库发票号，开票日期，规则，单价，序列号，有效期至）'''
# Oa_PO.stock_in("入库", "阴曹地府", "ycdf1000","invoice1000","2020-11-17","CPT-1200"，"75.10", "serial1000","2020-12-31")

'''2,出库 （配送商，配送医院，收货人，发票号码，开盘日期，预计回款，序列号，出库单价，开票日期，规则，单价，序列号，有效期至）'''
# Oa_PO.stock_out("出库", "配送商1000", "上海宏康医院","invoice1000","2020-11-17","CPT-1200"，"75.10", "serial1000","2020-12-31")


