# coding=utf-8
#***************************************************************
# Author     : John
# Created on : 2019-5-7
# Description: OA - 常用工作（）

#***************************************************************

import os, sys
# sys.path.append("../../../../")
from instance.zyjk.OA.PageObject.OaPO import *
Oa_PO = OaPO()
List_PO = ListPO()
Time_PO = TimePO()
Net_PO = NetPO()
Data_PO = DataPO()
File_PO = FilePO()
Excel_PO = ExcelPO()
Char_PO = CharPO()

#***************************************************************#***************************************************************
# 请假申请

# Oa_PO.askOff("请假申请", 1, "所有人员")
# Oa_PO.askOff("请假申请", 1, '赵云')
# Oa_PO.askOff("请假申请", 1, "赵云,陈晓东")

# 场景2：请假申请3天
# Oa_PO.askOff("请假申请", 3, "所有人员")
# Oa_PO.askOff("请假申请", 3, '赵云')
# Oa_PO.askOff("请假申请", 3, "赵云,陈晓东")


#***************************************************************#***************************************************************
# 外出申请
# Oa_PO.egression('所有人')
# Oa_PO.egression('空')
# Oa_PO.egression('宾梓洋,李斌,唐坤超')


#***************************************************************#***************************************************************
# 出差申请
# 出差3天以内，包含3天。（默认）
# Oa_PO.evection('所有人')
# Oa_PO.evection('空')
# Oa_PO.evection('宾梓洋,李斌,唐坤超')

# 出差3天以上
# Oa_PO.evection('所有人', 4)
# Oa_PO.evection('空', 4)
# Oa_PO.evection('宾梓洋,李斌,唐坤超', 4)

