# coding=utf-8
#***************************************************************
# Author     : John
# Created on : 2019-5-7
# Description: OA 自动化脚本（请假申请单、外出申请单、出差申请单、借款申请单、付款申请单、固定资产采购申请单、办公用品采购申请单、费用报销申请单）
#***************************************************************

import os, sys
# sys.path.append("../../../../")
from instance.zyjk.OA.PageObject.OaPO import *
Oa_PO = OaPO()
List_PO = ListPO()
Time_PO = TimePO()
Net_PO = NetPO()
Data_PO = DataPO()
File_PO = FilePO()
Excel_PO = ExcelPO()
Char_PO = CharPO()


#***************************************************************#***************************************************************
'''1,请假申请单（参数：模块名，测试对象，天数）'''
# s1,请假1天
# Oa_PO.application("请假申请单", "所有人", 1)
# Oa_PO.application("请假申请单", "空", 1)
# Oa_PO.application("请假申请单", "ronghui.", 1)
# s2,请假3天及以上
# Oa_PO.application("请假申请单", "所有人", 3)
# Oa_PO.application("请假申请单", "空", 3)
# Oa_PO.application("请假申请单", "ronghui.", 3)

# s3,审核不通过（未做）

#***************************************************************#***************************************************************
'''2,外出申请单（参数：模块名，测试对象，天数[默认1天]）'''
# Oa_PO.application("外出申请单", "所有人", 1)
# Oa_PO.application("外出申请单", "空", 1)
# Oa_PO.application("外出申请单", "ronghui.", 1)

#***************************************************************#***************************************************************
'''3,出差申请单（参数：模块名，测试对象，天数'''
# s1，出差<=3天
# Oa_PO.application("出差申请单", "所有人", 1)
# Oa_PO.application("出差申请单", "空", 1)
# Oa_PO.application("出差申请单", "ronghui.", 1)
# s2，出差>3天
# Oa_PO.application("出差申请单", "所有人", 4)
# Oa_PO.application("出差申请单", "空", 4)
# Oa_PO.application("出差申请单", "ronghui.", 4)

#***************************************************************#***************************************************************
'''4,借款申请单'''
# Oa_PO.application("借款申请单", "所有人")
# Oa_PO.application("借款申请单", "姜育")

#***************************************************************#***************************************************************
'''5,付款申请单'''
# Oa_PO.application("付款申请单", "所有人")
# Oa_PO.application("付款申请单", "金浩")

#***************************************************************#***************************************************************
'''6,固定资产/项目设备采购申请单'''
# Oa_PO.application("项目设备采购申请单", "所有人")
# Oa_PO.application("项目设备采购申请单", "戎辉.")
Oa_PO.application("项目设备采购申请单", "空")

#***************************************************************#***************************************************************
'''7,办公用品采购申请单'''
# Oa_PO.application("办公用品采购申请单", "所有人")

#***************************************************************#***************************************************************
'''8,费用报销申请单'''
# Oa_PO.application("费用报销申请单", "所有人")