# coding=utf-8
#***************************************************************
# Author     : John
# Created on : 2019-5-7
# Description: OA 自动化脚本（请假，外出，出差，借款，付款，固定资产采购，办公用品采购，费用报销）
#***************************************************************

import os, sys
# sys.path.append("../../../../")
from instance.zyjk.OA.PageObject.OaPO import *
Oa_PO = OaPO()
List_PO = ListPO()
Time_PO = TimePO()
Net_PO = NetPO()
Data_PO = DataPO()
File_PO = FilePO()
Excel_PO = ExcelPO()
Char_PO = CharPO()


#***************************************************************#***************************************************************
'''1,请假申请单（参数：模块名，测试对象，天数）'''
# s1,请假1天
# Oa_PO.application("请假申请单", "所有人", 1)
# Oa_PO.askOffAudit("2/5, ", "6420", "部门领导", "金浩", "同意", "批准")
Oa_PO.application("请假申请单", "空", 1)
# Oa_PO.application("请假申请单", "ronghui.", 1)

# s2,请假3天及以上
# Oa_PO.application("请假申请单", "所有人", 3)
# Oa_PO.application("请假申请单", "空", 3)
# Oa_PO.application("请假申请单", "ronghui.", 3)

# s3,审核不通过（未做）


#***************************************************************#***************************************************************
'''2,外出申请单（参数：模块名，测试对象，1天[默认值]）'''
# Oa_PO.application("外出申请单", "所有人", 1)
# Oa_PO.application("外出申请单", "空", 1)
# Oa_PO.application("外出申请单", "ronghui.", 1)

# Oa_PO.egression('所有人')
# Oa_PO.egression('空')
# Oa_PO.egression('ronghui.')

#***************************************************************#***************************************************************
'''s3,出差申请（默认<=3天）'''
# 1，出差<=3天
# Oa_PO.evection('所有人')
# Oa_PO.evection('空')
# Oa_PO.evection('宾梓洋,李斌,唐坤超')

# 2，出差>3天
# Oa_PO.evection('所有人', 4)
# Oa_PO.evection('空', 4)
# Oa_PO.evection('宾梓洋,李斌,唐坤超', 4)

#***************************************************************#***************************************************************
'''s4,借款申请单'''
# Oa_PO.application("借款申请单")

#***************************************************************#***************************************************************
'''s6,固定资产/项目设备采购申请单'''
# Oa_PO.application("固定资产采购申请单")