# coding: utf-8
# *******************************************************************
# Author     : John
# Date       : 2021-1-18
# Description: 元组（tuple）是一个有序的、可重复的、不可变的元素序列，用（）表。
# 元组的元素是有序的，可通过偏移来访问元素
# 元组的元素是可重复的
# 元组的元素是不可变的
# 元组可以是任何数据类型，也可以嵌套，支持索引和切片

# 特点：元组的速度比列表快，如定义了一系列常量值。
# *******************************************************************

'''
1，创建元组 t=()
2，2，索引、嵌套、切片元组  t[i],t[i][j],t[i:j]
3，元组基本操作(合计，合并，复制，（非）包含，索引号，合计指定元素)
4，列表\集合\字符串\字典 转元组
'''



print("1，创建元组".center(100, "-"))
t = ()
print(t)   # ()
t = (1,)
print(t)  # (1,)
t = tuple('123')  # tuple()接收1个参数，且只支持字符串（字符串被打散成字符）
# t = tuple('123', "456")  # 错误，只支持1个参数
# t = tuple(123)  # 错误，不支持数字
print(t)  # ('1', '2', '3')
t = tuple([1, 2, 3])  # 列表转元组
print(t)  # (1, 2, 3)


print("2，索引、嵌套、切片元组".center(100, "-"))
t = ([1, 2], ['a', 'b'], [100, 200])
print(t[1])  # ['a', 'b']
print(t[1][0])  # a
print(t[0:1])  # ([1, 2],)
print(t[0:2])  # ([1, 2], ['a', 'b'])
print(t[0:])  # ([1, 2], ['a', 'b'], [100, 200])
print(t[0:2][1][1])  # b
print(t[0:-1])  # ([1, 2], ['a', 'b'])


print("3，元组基本操作(合计，合并，复制，（非）包含，索引号，合计指定元素)".center(100, "-"))
t = (1, 2)
t2 = (3, 4, 4, 4)
print(len(t+t2))  # 6
print(t+t2)  # (1, 2, 3, 4, 4, 4)
print(t*2)  # (1, 2, 1, 2)
print(1 in t)  # True
print(t2.index(4))  # 1
print(t2.count(4))  # 3


print("4，列表\集合\字符串\字典 转元组".center(100, "-"))
print(tuple([1, 2, 3]))  # (1, 2, 3)
print(tuple([1, False, 3, True]))  # (1, 2, 3)
print(tuple({1, '2', 3}))  # (1, 3, '2')
print(tuple("123"))  # ('1', '2', '3')
print(tuple({1: "a", "b": 2}))  # (1, 'b')