# coding: utf-8
# ********************************************************************************************************************
# Author     : John
# Date       : 2017-12-19
# Description: 输入编号，返回相应内容
# ********************************************************************************************************************

'''
输入1，计算10+2，返回12
输入2，计算10-2，返回8
输入3，计算10*2，返回20
输入其他数字，退出程序，否则循环提示输入信息
'''

tips = "1 : +\n2 : -\n3 : *\nother to quit\n"

d1 = {
    '1': lambda x, y: x + y,
    '2': lambda x, y: x - y,
    '3': lambda x, y: x * y}

if __name__ == '__main__':
    while True:
        print(tips)
        inputInfo = input('Input : ')
        if inputInfo not in d1:
            break
        print(d1[inputInfo](10, 2), "\n")

