# coding: utf-8
# *****************************************************************
# Author     : John
# Date       : 2022-3-21
# Description: 拼接/切分 横拼接 hstack(),竖拼接 vstack(),横分割 hsplit(),竖分割 vsplit()
# 水平 = horizontal
# 垂直 = vertical
# *****************************************************************

import numpy as np

n1 = np.array([[10, 11], [12, 13]])
n2 = np.array([[40, 51], [62, 73]])
n3 = np.array([[1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12], [22, 33, 44, 55, 66, 77, 88, 99, 100, 101, 102, 103]])

print("1 横拼接 hstack()".center(100, "-"))
print(np.hstack((n1, n2)))
# [[10 11 40 51]
#  [12 13 62 73]]


print("2 竖拼接 vstack()".center(100, "-"))
print(np.vstack((n1, n2)))
# [[10 11]
#  [12 13]
#  [40 51]
#  [62 73]]


print("3 横分割 hsplit(),分割成3组".center(100, "-"))
print(np.hsplit(n3, 3))
# [array([[ 1,  2,  3,  4],[22, 33, 44, 55]]),
#  array([[ 5,  6,  7,  8],[66, 77, 88, 99]]),
#  array([[  9,  10,  11,  12],[100, 101, 102, 103]])]


print("4 横分割 hsplit(),3，5分别表示在索引处切一刀".center(100, "-"))
print(np.hsplit(n3,(3, 5)))
# [array([[ 1,  2,  3], [22, 33, 44]]),
#  array([[ 4,  5], [55, 66]]),
#  array([[  6,   7,   8,   9,  10,  11,  12],[ 77,  88,  99, 100, 101, 102, 103]])]


print("4 竖分割 vsplit()".center(100, "-"))
print(n3.T)
print(np.vsplit(n3.T, 3))
# [[  1  22]
#  [  2  33]
#  [  3  44]
#  [  4  55]
#  [  5  66]
#  [  6  77]
#  [  7  88]
#  [  8  99]
#  [  9 100]
#  [ 10 101]
#  [ 11 102]
#  [ 12 103]]
# [array([[ 1, 22],
#        [ 2, 33],
#        [ 3, 44],
#        [ 4, 55]]), array([[ 5, 66],
#        [ 6, 77],
#        [ 7, 88],
#        [ 8, 99]]), array([[  9, 100],
#        [ 10, 101],
#        [ 11, 102],
#        [ 12, 103]])]



